$(document).ready(function() {
  var quote;
  var author;
   function getNewQuote() {
     $.ajax({
     url:'https://api.forismatic.com/api/1.0/',
      jsonp:'jsonp',
      dataType:'jsonp',
      data: {
        method: 'getQuote',
        lang: 'ru',
        format: 'jsonp'
      },
     success:function(response){
       quote = response.quoteText;
       author = response.quoteAuthor;
       $('#quote').text(quote);
       if (author) {
         $('#author').text(author);
       }else{
         $('#author').text('Автор неизвестен');
       }
       
     }  
     });
   }
  getNewQuote();
  $('#getQuote').on('click', function(event){
    event.preventDefault;
    getNewQuote();
  });
});

var text21 = "Існує два напрямки розвитку ШІ:";

var text22 = "перший полягає у вирішенні проблем, пов'язаних з наближенням спеціалізованих систем ШІ до можливостей людини та їх інтеграції, яка реалізована природою людини.";

var text23 = "другий полягає у створенні Штучного Розуму, який представляє інтеграцію уже створених систем ШІ в єдину систему, здібну вирішувати проблеми людства.";

$(document).ready(function() {
$('#change_back').click( function() {
  if ($('#sector').hasClass('first')) {
    $('#sector').removeClass('first').addClass('fourth');
    $('#sector').text("Застосування ШІ:");
    $('#sector2').removeClass('li1');
    $('#sector3').removeClass('li1');
    $('#sector4').removeClass('li1');
    $('#sector5').removeClass('li1');
    $('#sector2').text("Банки застосовують системи штучного інтелекту (СШІ) в страховій діяльності (актуарна математика) при грі на біржі і управлінні власністю. У серпні 2001 року роботи виграли в людей у імпровізованому змаганні з трейдингу (BBC News, 2001). Методи розпізнавання образів, (включаючи, як складніші й спеціалізованіші, так і нейронні сітки) широко використовують при оптичному і акустичному розпізнаванні (в тому числі тексту і голосу), медичній діагностиці, спам-фільтрах, в системах ППО (визначення цілей), а також для забезпечення ряду інших задач національної безпеки.");
    $('#sector3').text("Застосування ШІ є важливим трендом у створенні перспективних систем управління поля бою та озброєнням. За допомогою ШІ можливо забезпечити оптимальний та адаптивний до загроз вибір комбінації сенсорів і засобів ураження, скоординувати їх сумісне функціонування, виявляти та ідентифікувати загрози; оцінювати наміри противника. Суттєву роль ШІ відіграє у реалізації тактичних систем доповненої реальності. Наприклад, ШІ дозволяє забезпечити класифікацію та семантичну сегментацію зображень, локалізацію і ідентифікацію мобільних об'єктів з метою схематичного відтворення контурів об'єктів в якості символів доповненої реальності для ефективного цілевказування.");
    $('#sector4').text("Розробники комп'ютерних ігор вимушені застосовувати ШІ тої чи іншої міри пропрацьованості. Стандартними задачами ШІ в іграх є відшукання шляху в двовимірному або тривимірному просторі, імітація поведінки бойової одиниці, обрахунок вірної економічної стратегії і так далі.");
    $('#sector5').text("Перспективним напрямом застосування ШІ є наукові дослідження, де він задіяний для аналізу наукових публікацій з метою синтезу нових знань, відкриття нових матеріалів, закономірностей тощо. Цікавий факт: За допомогою алгоритму машинного навчання на основі штучного інтелекту вдалося знайти близько 50 нових екзопланет.");
    return;
  }
  if ($('#sector').hasClass('second')) {
    $('#sector').removeClass('second').addClass('first');
    $('#sector2').addClass('li1');
    $('#sector3').addClass('li1');
    $('#sector4').addClass('li1');
    $('#sector5').addClass('li1');
    $('#sector').text("Штучний інтелект (ШІ) - механізм або програма, яка, беручи до уваги ту чи іншу інформацію, самостійно розробляє алгоритм вирішення поставленої проблеми. Від звичайних пасивних механізмів та програм відрізняється гибкістю, адаптивністю та певним потенціалом до самовдосконалення.");
    return;
  }
  if ($('#sector').hasClass('third')) {
    $('#sector').removeClass('third').addClass('second');
    $('#sector').text(text21);
    $('#sector2').text(text22);
    $('#sector3').text(text23);
    $('#sector2').removeClass('li1');
    $('#sector3').removeClass('li1'); 
    $('#sector4').addClass('li1');
    $('#sector5').addClass('li1'); 
    return;
  }
  if ($('#sector').hasClass('fourth')) {
    $('#sector').removeClass('fourth').addClass('third');
    $('#sector').text("Існують різні методи створення систем штучного інтелекту. У наш час можна виділити 4 із них:");
    $('#sector2').removeClass('li1');
    $('#sector3').removeClass('li1');
    $('#sector4').removeClass('li1');
    $('#sector5').removeClass('li1');
    $('#sector2').text('Логічний підхід. Основою для вивчення логічного підходу слугує алгебра логіки. Кожен програміст знайомий з нею з того часу, коли він вивчав оператор IF. Кожна машина запрограмована таким чином має блок генерації цілі, і система виводу намагається довести дану ціль як теорему. Якщо ціль досягнута, то послідовність використаних правил дозволить отримати ланцюжок дій, необхідних для реалізації поставленої цілі (таку систему ще називають експертною системою). Потужність такої системи визначається можливостями генератора цілей і машинного доведення теорем.');
    $('#sector3').text('Під структурним підходом ми розуміємо спроби побудови ШІ шляхом моделювання структури людського мозку. Потужність такої системи визначається можливостями генератора цілей і машинного доведення теорем (такі системи ще називають нейронними мережами). Відмінності між логічним та структурним підходом не стільки принципові, як це здається на перший погляд. Алгоритми спрощення і вербалізації нейронних мереж перетворюють моделі структурного підходу на явні логічні моделі.');
    $('#sector4').text('Еволюційний підхід. Під час побудови системи ШІ за даним методом основну увагу зосереджують на побудові початкової моделі і правилах, за якими вона може змінюватися (еволюціонувати). Причому модель може бути створено за найрізноманітнішими методами, це може бути і НМ, і набір логічних правил, і будь-яка інша модель. Після цього ми вмикаємо ПК і він на основі перевірки моделей відбирає найкращі з них, і за цими моделями за найрізноманітнішими правилами генеруються нові моделі. Серед еволюційних алгоритмів класичним вважається генетичний алгоритм.');
    $('#sector5').text('Імітаційний підхід. Цей підхід є класичним для кібернетики з одним із її базових понять чорний ящик. Обєкт, поведінка якого імітується, якраз і являє собою «чорний ящик». Для нас не важливо, які моделі у нього всередині і як він діє, головне, щоби наша модель в аналогічних ситуаціях поводила себе без змін. Таким чином тут моделюється інша властивість людини — здатність копіювати те, що роблять інші, без поділу на елементарні операції і формального опису дій. Часто ця властивість економить багато часу обєктові, особливо на початку його життя.');
    return;
  }
  });
});

$(document).ready(function() {
$('#change_forward').click( function() {
  if ($('#sector').hasClass('fourth')) {
    $('#sector').removeClass('fourth').addClass('first');
    $('#sector2').addClass('li1');
    $('#sector3').addClass('li1');
    $('#sector4').addClass('li1');
    $('#sector5').addClass('li1');
    $('#sector').text("Штучний інтелект (ШІ) - механізм або програма, яка, беручи до уваги ту чи іншу інформацію, самостійно розробляє алгоритм вирішення поставленої проблеми. Від звичайних пасивних механізмів та програм відрізняється гибкістю, адаптивністю та певним потенціалом до самовдосконалення.");
    return;
  }
  if ($('#sector').hasClass('first')) {
    $('#sector').removeClass('first').addClass('second');
    $('#sector').text(text21);
    $('#sector2').text(text22);
    $('#sector3').text(text23);
    $('#sector2').removeClass('li1');
    $('#sector3').removeClass('li1');
    $('#sector4').addClass('li1');
    $('#sector5').addClass('li1');
    return;
  }
  if ($('#sector').hasClass('second')) {
    $('#sector').removeClass('second').addClass('third');
    $('#sector').text("Існують різні методи створення систем штучного інтелекту. У наш час можна виділити 4 із них:");
    $('#sector2').removeClass('li1');
    $('#sector3').removeClass('li1');
    $('#sector4').removeClass('li1');
    $('#sector5').removeClass('li1');
    $('#sector2').text('Логічний підхід. Основою для вивчення логічного підходу слугує алгебра логіки. Кожен програміст знайомий з нею з того часу, коли він вивчав оператор IF. Кожна машина запрограмована таким чином має блок генерації цілі, і система виводу намагається довести дану ціль як теорему. Якщо ціль досягнута, то послідовність використаних правил дозволить отримати ланцюжок дій, необхідних для реалізації поставленої цілі (таку систему ще називають експертною системою). Потужність такої системи визначається можливостями генератора цілей і машинного доведення теорем.');
    $('#sector3').text('Під структурним підходом ми розуміємо спроби побудови ШІ шляхом моделювання структури людського мозку. Потужність такої системи визначається можливостями генератора цілей і машинного доведення теорем (такі системи ще називають нейронними мережами). Відмінності між логічним та структурним підходом не стільки принципові, як це здається на перший погляд. Алгоритми спрощення і вербалізації нейронних мереж перетворюють моделі структурного підходу на явні логічні моделі.');
    $('#sector4').text('Еволюційний підхід. Під час побудови системи ШІ за даним методом основну увагу зосереджують на побудові початкової моделі і правилах, за якими вона може змінюватися (еволюціонувати). Причому модель може бути створено за найрізноманітнішими методами, це може бути і НМ, і набір логічних правил, і будь-яка інша модель. Після цього ми вмикаємо ПК і він на основі перевірки моделей відбирає найкращі з них, і за цими моделями за найрізноманітнішими правилами генеруються нові моделі. Серед еволюційних алгоритмів класичним вважається генетичний алгоритм.');
    $('#sector5').text('Імітаційний підхід. Цей підхід є класичним для кібернетики з одним із її базових понять чорний ящик. Обєкт, поведінка якого імітується, якраз і являє собою «чорний ящик». Для нас не важливо, які моделі у нього всередині і як він діє, головне, щоби наша модель в аналогічних ситуаціях поводила себе без змін. Таким чином тут моделюється інша властивість людини — здатність копіювати те, що роблять інші, без поділу на елементарні операції і формального опису дій. Часто ця властивість економить багато часу обєктові, особливо на початку його життя.');
    return;
  }
  if ($('#sector').hasClass('third')) {
    $('#sector').removeClass('third').addClass('fourth');
    $('#sector').text("Застосування ШІ:");
    $('#sector2').text("Банки застосовують системи штучного інтелекту (СШІ) в страховій діяльності (актуарна математика) при грі на біржі і управлінні власністю. У серпні 2001 року роботи виграли в людей у імпровізованому змаганні з трейдингу (BBC News, 2001). Методи розпізнавання образів, (включаючи, як складніші й спеціалізованіші, так і нейронні сітки) широко використовують при оптичному і акустичному розпізнаванні (в тому числі тексту і голосу), медичній діагностиці, спам-фільтрах, в системах ППО (визначення цілей), а також для забезпечення ряду інших задач національної безпеки.");
    $('#sector3').text("Застосування ШІ є важливим трендом у створенні перспективних систем управління поля бою та озброєнням. За допомогою ШІ можливо забезпечити оптимальний та адаптивний до загроз вибір комбінації сенсорів і засобів ураження, скоординувати їх сумісне функціонування, виявляти та ідентифікувати загрози; оцінювати наміри противника. Суттєву роль ШІ відіграє у реалізації тактичних систем доповненої реальності. Наприклад, ШІ дозволяє забезпечити класифікацію та семантичну сегментацію зображень, локалізацію і ідентифікацію мобільних об'єктів з метою схематичного відтворення контурів об'єктів в якості символів доповненої реальності для ефективного цілевказування.");
    $('#sector4').text("Розробники комп'ютерних ігор вимушені застосовувати ШІ тої чи іншої міри пропрацьованості. Стандартними задачами ШІ в іграх є відшукання шляху в двовимірному або тривимірному просторі, імітація поведінки бойової одиниці, обрахунок вірної економічної стратегії і так далі.");
    $('#sector5').text("Перспективним напрямом застосування ШІ є наукові дослідження, де він задіяний для аналізу наукових публікацій з метою синтезу нових знань, відкриття нових матеріалів, закономірностей тощо. Цікавий факт: За допомогою алгоритму машинного навчання на основі штучного інтелекту вдалося знайти близько 50 нових екзопланет.");
    return;
  }
 });
});